{
  "name": "Victor Fernandes",
  "location": "Porto, Portugal",
  "phone": "+351 939 327 856",
  "email": "victorfern91@gmail.com",
  "welcoming_text": "I am a Senior Front-end Engineer with a background in Electrical and Computer Engineering. Although I started my career in Computer Vision, Machine Learning, and Pattern Matching, I soon discovered my passion for front-end development. I am motivated by developing clean, reusable code that results in high-quality software. I enjoy streamlining the CI/CD pipeline and improving quality assurance processes. My interest in minimal design and creating usable UIs for products led me to specialize in front-end development.",
  "work": [
    {
      "company": "Rows",
      "link": "https://rows.com",
      "location": "Remote",
      "position": "Senior Frontend Engineer",
      "start_date": "03/2021",
      "end_date": "present",
      "highlights": [
        {
          "summary": "Rows is a startup company revolutionizing the spreadsheet industry with its \"supercharged\" version of the traditional spreadsheet.\n\nTo enhance the performance of our web application, I designed an internal tool that measures the performance in the pipelines, providing valuable data during the refactoring and feature development process. I also took the initiative to design and implement new features from the ground up, such as the function wizard, data tables, and pivot tables. In addition, I assisted with several refactors, ensuring a smooth and efficient development process.\n\nBeyond these core contributions, I have also developed a color picker that enhances readability when we have a background color. Recently, I developed and shipped the RowsX (Google Chrome extension) from scratch, a powerful tool for scraping web pages and importing data into Rows.com.",
          "technologies": ["React","MobX","WebdriverIO","Apollo","GraphQL", "WebWorker", "Konva", "Puppeteer", "JSPerf"]
        }
      ]
    },
    {
      "company": "Talkdesk",
      "link": "https://talkdesk.com",
      "location": "Porto, Portugal",
      "position": "Frontend Engineer",
      "start_date": "06/2019",
      "end_date": "03/2021",
      "highlights": [
        {
          "summary": "At Talkdesk, developed and improved the performance and reliability of the Studio application, a graph-based tool for managing workflows. Implemented a canvas-based solution to improve the user experience and contributed to improving the performance and reliability of end-to-end tests, which played a crucial role in ensuring the quality of products. Created helpful tools to automate steps of the deployment process of some services using Node.js.",
          "technologies": ["React","Redux","WebdriverIO", "HTML Canvas", "Node.js", "Puppeteer"]
        }
      ]
    },
    {
      "company": "Feedzai",
      "link": "https://feedzai.com",
      "location": "Porto & Lisboa, Portugal",
      "position": "Frontend Engineer",
      "start_date": "05/2017",
      "end_date": "03/2019",
      "highlights": [
        {
          "summary": "At Feedzai, migrated the front-end from BackboneJS to React, updated the webpack configuration, automated front-end pipelines, and developed tools to enhance the developer experience. Additionally, I created an ESLint configuration for multiple UI products across the company.\n I led the Front-End and QA teams for the development and launch of Feedzai Genome and also I contributed to DevOps.\nIn this project, I was able to:",
          "competences": [
            "Start to be more focused on the development of software focused on performance.",
            "Due to their scenario (having more than 10,000 nodes graph in browser) we needed to develop a custom-based canvas framework to bring the best performance and UX into the browser.",
            "Work with cypress.io to automate our development and production pipelines.",
            "Start to work close to gitlab.ci to create our CI/CD pipelines.",
            "Use puppeteer to create a web app performance tool."
          ],
          "technologies": [
            "Webpack", "Backbone", "React", "Redux", "D3.js", "Web APIs", "Node.js", "Cypress.io", "Gitlab CI"
          ]
        }
      ]
    },
    {
      "company": "MOG Technologies",
      "link": "https://mog-technologies.com",
      "location": "Maia, Porto, Portugal",
      "position": "Software Engineer",
      "start_date": "10/2013",
      "end_date": "05/2017",
      "highlights": [
        {
          "summary": "At MOG, a provider of multimedia solutions using open industry standards, I built SkyWatch, an application that streamlines media asset workflows and production environment management for broadcasters. As a Front-End Developer, I defined the product architecture, made technical decisions, and built the SkyWatch Single Page Application using HTML5 and JavaScript (Backbone.js, require.js, Ractive, and other frameworks). I also created unit tests for our UI code, led a major refactoring process, automated our front-end development and deployment tasks, and mentored junior developers. I implemented features using web browsers' native Web APIs and contributed to other projects, such as making the CI pipeline autonomous and creating back-end services.",
          "technologies": [
            "C++",
            "OpenCV",
            "Backbone",
            "React",
            "Web APIs",
            "Node.js",
            "MPEG Dash",
            "Jenkins",
            "Gitlab"
          ]
        }
      ]
    }
  ],
  "education": [
    {
      "school": "Instituto Superior de Engenharia do Porto",
      "name": "Master's degree in Electrical and Computer Engineering",
      "location": "Porto, Portugal",
      "start_date": "2012",
      "end_date": "2014"
    },
    {
      "school": "Instituto Superior de Engenharia do Porto",
      "name": "Bachelor's degree in Electrical and Computer Engineering",
      "location": "Porto, Portugal",
      "start_date": "2009",
      "end_date": "2011"
    }
  ],
  "extracurricular_activities": "I am a passionate outdoor person and I'm a creative enthusiast seeking a challenging and rewarding career in mountain guiding. I have a strong interest in planning and executing expeditions in nature, especially in climbing, mountaineering, skiing, and scuba diving. I thrill in the careful planning and execution of outdoor excursions, considering all aspects from route planning and gear selection to contingency planning and safety measures. I find that this type of planning, coupled with the adrenaline rush of outdoor sports, creates a unique and rewarding experience.\n\nIn addition to my passion for outdoor leadership and adventure, I also enjoy cinema, photography, and music, which allow me to express my creative side."
}
