{
  "name": "Victor Fernandes",
  "location": "Porto, Portugal",
  "phone": "+351 939 327 856",
  "email": "victorfern91@gmail.com",
  "welcoming_text": "I'm a Senior Front-end Engineer with 12 years of experience. After starting out in Computer Vision and Machine Learning, I found my passion in front-end development, driven by clean code, usable interfaces, and well-crafted design. I also enjoy refining CI/CD workflows and improving QA processes. My interest in minimal design and creating usable UIs for products led me to specialize in front-end development.",
  "work": [
    {
      "company": "Amplemarket",
      "link": "https://amplemarket.com",
      "logo": "amplemarket.jpeg",
      "location": "Remote",
      "position": "Senior Frontend Engineer",
      "start_date": "06/2025",
      "end_date": "present",
      "highlights": [
        {
          "summary": "I am responsible for enhancing the user experience and performance of their in-house built spreadsheet and keep shipping the existing features.",
          "technologies": ["React", "TailwindCSS", "Tanstack", "SASS"]
        }
      ]
    },
    {
      "company": "Translucent",
      "link": "https://translucent.io",
      "logo": "translucent.jpeg",
      "location": "Remote",
      "position": "Senior Frontend Engineer / Tech Lead",
      "start_date": "03/2024",
      "end_date": "06/2025",
      "highlights": [
        {
          "summary": "I worked as a tech lead driving front-end improvements. I introduced the first charting and data visualization components, promoted reusable data tables, and led major refactors of the web application.\nMy role involved building some backend endpoints by writing SQL queries that ensured data integration with the UI, while also prototyping internal tools using Retool.",
          "technologies": ["React", "TailwindCSS", "NextJS", "Zustand","Retool","Kotlin", "Python","PostgreSQL", "AI", "Tanstack", "Motion"]
        }
      ]
    },
    {
      "company": "Rows",
      "link": "https://rows.com",
      "logo": "rows.jpeg",
      "location": "Remote",
      "position": "Senior Frontend Engineer",
      "start_date": "03/2021",
      "end_date": "03/2024",
      "highlights": [
        {
          "summary": "To improve our application's performance and efficiency, I designed and implemented an internal tool that streamlines pipeline measurements, providing valuable insights during the refactoring and feature development phases.\nThis includes creating innovative features such as the Function Wizard, data tables, and pivot tables, and refining the development process through thorough refactors. In addition to these core contributions, I developed a color picker that enhances readability by incorporating a background color option, allowing us to easily scan through large amounts of content. I also created RowsX (Google Chrome extension), a powerful tool for web scraping and data import capabilities.",
          "technologies": ["React","MobX","WebdriverIO","Apollo","GraphQL", "WebWorker", "Konva", "Puppeteer", "JSPerf", "Chrome Extension"]
        }
      ]
    },
    {
      "company": "Talkdesk",
      "link": "https://talkdesk.com",
      "logo": "talkdesk.jpeg",
      "location": "Porto, Portugal",
      "position": "Frontend Engineer",
      "start_date": "06/2019",
      "end_date": "03/2021",
      "highlights": [
        {
          "summary": "I improved the performance and reliability of the Studio application, a graph-based tool for managing workflows. Implemented a canvas-based solution to improve the user experience and contributed to improving the performance and reliability of end-to-end tests, which played a crucial role in ensuring the quality of products. Created helpful tools to automate steps of the deployment process of some services using Node.js.",
          "technologies": ["React","Redux","WebdriverIO", "HTML Canvas", "Node.js", "Puppeteer"]
        }
      ]
    },
    {
      "company": "Feedzai",
      "link": "https://feedzai.com",
      "logo": "feedzai.jpeg",
      "location": "Porto & Lisboa, Portugal",
      "position": "Frontend Engineer",
      "start_date": "05/2017",
      "end_date": "03/2019",
      "highlights": [
        {
          "summary": "During my time at Feedzai, I successfully migrated the front-end from Backbone.js to React, updated our webpack configuration, automated various development pipelines, and developed tools to enhance the developer experience.\nI also created an ESLint configuration for multiple UI products across the company, which streamlined our code quality management process. Additionally, I led cross-functional teams on launching Feedzai Genome, a project that required significant collaboration and automation efforts.\nIn this project, I made significant strides in my focus on performance-focused software development. Specifically:",
          "competences": [
            "I've developed a custom-based canvas framework to optimize browser performance.",
            "I worked closely with Cypress.io to automate our development and production pipelines, ensuring seamless integration with Gitlab CI.",
            "I used Puppeteer to create a web app performance tool."
          ],
          "technologies": [
            "Webpack", "Backbone", "React", "Redux", "D3.js", "Web APIs", "Node.js", "Cypress.io", "Gitlab CI"
          ]
        }
      ]
    },
    {
      "company": "MOG (an EVS company)",
      "link": "https://mog-technologies.com",
      "logo": "mog.jpeg",
      "location": "Maia, Porto, Portugal",
      "position": "Software Engineer",
      "start_date": "10/2013",
      "end_date": "05/2017",
      "highlights": [
        {
          "summary": "I defined the product architecture, made key technical decisions, and built the SPA using HTML5, JavaScript, and frameworks like Backbone.js, Require.js, and Ractive. I also contributed to test coverage, CI pipeline automation, front-end deployment workflows, and mentored junior developers. Additionally, I worked with native Web APIs and supported back-end services.",
          "technologies": [
            "C++",
            "OpenCV",
            "Backbone",
            "React",
            "Web APIs",
            "Node.js",
            "MPEG Dash",
            "Video Streaming",
            "Jenkins",
            "Gitlab"
          ]
        }
      ]
    }
  ],
  "education": [
    {
      "school": "Instituto Superior de Engenharia do Porto",
      "name": "Master's degree in Electrical and Computer Engineering",
      "location": "Porto, Portugal",
      "start_date": "2012",
      "end_date": "2014"
    },
    {
      "school": "Instituto Superior de Engenharia do Porto",
      "name": "Bachelor's degree in Electrical and Computer Engineering",
      "location": "Porto, Portugal",
      "start_date": "2009",
      "end_date": "2011"
    }
  ],
  "extracurricular_activities": "I’m a passionate outdoors enthusiast pursuing a fulfilling career in mountain guiding. I thrive on planning and leading expeditions, with a strong focus on climbing, mountaineering, skiing, and scuba diving. I enjoy the balance between detailed preparation—route planning, gear selection, safety measures and the excitement of adventure.\n\nBeyond the mountains, I’m also drawn to creative outlets like cinema, photography, and music, which allow me to express a different side of myself."
}
